{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      ",": 5,
      "-": 6,
      ".": 7,
      "a": 8,
      "b": 9,
      "c": 10,
      "d": 11,
      "e": 12,
      "f": 13,
      "g": 14,
      "h": 15,
      "i": 16,
      "k": 17,
      "l": 18,
      "m": 19,
      "n": 20,
      "o": 21,
      "p": 22,
      "q": 23,
      "r": 24,
      "s": 25,
      "t": 26,
      "u": 27,
      "v": 28,
      "w": 29,
      "x": 30,
      "y": 31,
      "z": 32,
      "##a": 33,
      "##t": 34,
      "##u": 35,
      "##r": 36,
      "##l": 37,
      "##o": 38,
      "##p": 39,
      "##s": 40,
      "##c": 41,
      "##e": 42,
      "##i": 43,
      "##g": 44,
      "##n": 45,
      "##d": 46,
      "##y": 47,
      "##v": 48,
      "##k": 49,
      "##b": 50,
      "##w": 51,
      "##f": 52,
      "##m": 53,
      "##h": 54,
      "##q": 55,
      "##x": 56,
      "##z": 57,
      "##en": 58,
      "##in": 59,
      "to": 60,
      "th": 61,
      "##an": 62,
      "##er": 63,
      "##ti": 64,
      "##es": 65,
      "##ing": 66,
      "in": 67,
      "##al": 68,
      "the": 69,
      "##re": 70,
      "##le": 71,
      "##iz": 72,
      "##ken": 73,
      "##ent": 74,
      "ma": 75,
      "tr": 76,
      "##on": 77,
      "##ch": 78,
      "##ces": 79,
      "##it": 80,
      "token": 81,
      "##tion": 82,
      "##izer": 83,
      "be": 84,
      "mo": 85,
      "##at": 86,
      "##ar": 87,
      "##to": 88,
      "##ow": 89,
      "##el": 90,
      "##is": 91,
      "##ic": 92,
      "mach": 93,
      "tokenizer": 94,
      "machin": 95,
      "co": 96,
      "is": 97,
      "of": 98,
      "sent": 99,
      "wit": 100,
      "##ain": 101,
      "##ation": 102,
      "##ed": 103,
      "##ning": 104,
      "##ences": 105,
      "this": 106,
      "into": 107,
      "train": 108,
      "more": 109,
      "sentences": 110,
      "with": 111,
      "an": 112,
      "dat": 113,
      "ef": 114,
      "fo": 115,
      "le": 116,
      "man": 117,
      "pr": 118,
      "re": 119,
      "su": 120,
      "te": 121,
      "##as": 122,
      "##uc": 123,
      "##rm": 124,
      "##ruc": 125,
      "##oces": 126,
      "##pl": 127,
      "##ig": 128,
      "##ial": 129,
      "##ks": 130,
      "##fic": 131,
      "##xt": 132,
      "##enti": 133,
      "##ans": 134,
      "##and": 135,
      "trans": 136,
      "##arning": 137,
      "machine": 138,
      "machines": 139,
      "training": 140,
      "data": 141,
      "learning": 142,
      "many": 143,
      "proces": 144,
      "text": 145,
      "process": 146,
      "at": 147,
      "ar": 148,
      "ap": 149,
      "as": 150,
      "ai": 151,
      "ad": 152,
      "by": 153,
      "bre": 154,
      "bas": 155,
      "ch": 156,
      "can": 157,
      "cal": 158,
      "cruc": 159,
      "des": 160,
      "dow": 161,
      "es": 162,
      "ex": 163,
      "fe": 164,
      "fi": 165,
      "fre": 166,
      "ha": 167,
      "hu": 168,
      "how": 169,
      "hand": 170,
      "ke": 171,
      "lan": 172,
      "me": 173,
      "nl": 174,
      "nat": 175,
      "on": 176,
      "ow": 177,
      "pl": 178,
      "pow": 179,
      "ro": 180,
      "st": 181,
      "sm": 182,
      "spl": 183,
      "senti": 184,
      "tas": 185,
      "un": 186,
      "we": 187,
      "wer": 188,
      "##ag": 189,
      "##ad": 190,
      "##ay": 191,
      "##ak": 192,
      "##ab": 193,
      "##tt": 194,
      "##ten": 195,
      "##tel": 196,
      "##ted": 197,
      "##truc": 198,
      "##ur": 199,
      "##ul": 200,
      "##us": 201,
      "##ui": 202,
      "##un": 203,
      "##uag": 204,
      "##rp": 205,
      "##ll": 206,
      "##ler": 207,
      "##ling": 208,
      "##lle": 209,
      "##lation": 210,
      "##lig": 211,
      "##om": 212,
      "##orm": 213,
      "##ple": 214,
      "##pand": 215,
      "##sis": 216,
      "##senti": 217,
      "##struc": 218,
      "##ce": 219,
      "##cti": 220,
      "##ction": 221,
      "##com": 222,
      "##ev": 223,
      "##ecti": 224,
      "##ir": 225,
      "##ient": 226,
      "##gin": 227,
      "##guag": 228,
      "##ned": 229,
      "##del": 230,
      "##ysis": 231,
      "##ve": 232,
      "##vent": 233,
      "##vel": 234,
      "##ke": 235,
      "##ful": 236,
      "##form": 237,
      "##fecti": 238,
      "##mm": 239,
      "##man": 240,
      "##ment": 241,
      "##mple": 242,
      "##qui": 243,
      "##ence": 244,
      "##aning": 245,
      "##ered": 246,
      "##tific": 247,
      "intel": 248,
      "instruc": 249,
      "##aller": 250,
      "##alysis": 251,
      "their": 252,
      "##led": 253,
      "##ization": 254,
      "##kenizer": 255,
      "make": 256,
      "##its": 257,
      "tokens": 258,
      "##tions": 259,
      "bett": 260,
      "becom": 261,
      "begin": 262,
      "model": 263,
      "##ats": 264,
      "##arted": 265,
      "##arization": 266,
      "##tokenizer": 267,
      "##ication": 268,
      "##ictokenizer": 269,
      "tokenizers": 270,
      "corp": 271,
      "colle": 272,
      "comple": 273,
      "often": 274,
      "and": 275,
      "analysis": 276,
      "effic": 277,
      "effecti": 278,
      "form": 279,
      "foll": 280,
      "read": 281,
      "requi": 282,
      "such": 283,
      "summ": 284,
      "##plication": 285,
      "##igned": 286,
      "translation": 287,
      "transform": 288,
      "processing": 289,
      "artific": 290,
      "application": 291,
      "advent": 292,
      "break": 293,
      "basictokenizer": 294,
      "chun": 295,
      "called": 296,
      "crucial": 297,
      "designed": 298,
      "down": 299,
      "essenti": 300,
      "expand": 301,
      "feel": 302,
      "file": 303,
      "free": 304,
      "have": 305,
      "human": 306,
      "howev": 307,
      "handling": 308,
      "key": 309,
      "languag": 310,
      "meaning": 311,
      "nlp": 312,
      "natur": 313,
      "own": 314,
      "play": 315,
      "powered": 316,
      "role": 317,
      "started": 318,
      "smaller": 319,
      "split": 320,
      "sentiment": 321,
      "tasks": 322,
      "units": 323,
      "were": 324,
      "##able": 325,
      "##ligence": 326,
      "##vely": 327,
      "intelligence": 328,
      "instructions": 329,
      "better": 330,
      "becomes": 331,
      "beginning": 332,
      "models": 333,
      "corpus": 334,
      "collection": 335,
      "complex": 336,
      "efficient": 337,
      "effectively": 338,
      "formats": 339,
      "follow": 340,
      "readable": 341,
      "require": 342,
      "summarization": 343,
      "transforming": 344,
      "artificial": 345,
      "applications": 346,
      "chunks": 347,
      "essential": 348,
      "however": 349,
      "language": 350,
      "meaningful": 351,
      "natural": 352
    }
  }
}